Revit 2027 API
StructuralAsset.MetalResistanceCalculationStrength Property
 The resistance calculation strength of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MetalResistanceCalculationStrength { get; set; }
Public Property MetalResistanceCalculationStrength As Double
	Get
	Set
public:
property double MetalResistanceCalculationStrength {
	double get ();
	void set (double value);
}
member MetalResistanceCalculationStrength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be Metal to set this property.
Remarks
 Applies to metal-based structural assets.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace